Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio.c
#include "retro_go_audio.h"

#include "retro_go_platform.h"

#include "cy_pdl.h"
#include "cybsp.h"

#include <drivers/audio.h>
#include <rtdevice.h>
#include <rtthread.h>

#include <string.h>

#define RETRO_GO_AUDIO_RING_SAMPLES 8192u
#define RETRO_GO_AUDIO_RING_MASK (RETRO_GO_AUDIO_RING_SAMPLES - 1u)
#define RETRO_GO_AUDIO_WRITE_SAMPLES 256u
#define RETRO_GO_AUDIO_RATE 16000u
#define RETRO_GO_AUDIO_STACK_BYTES 4096u
#define RETRO_GO_AUDIO_Q16_ONE 65536u

#ifndef BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES
#define BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES 1024
#endif

#ifndef BSP_RETRO_GO_AUDIO_START_BATCH_SAMPLES
#define BSP_RETRO_GO_AUDIO_START_BATCH_SAMPLES 1024
#endif

#ifndef BSP_RETRO_GO_AUDIO_TARGET_SAMPLES
#define BSP_RETRO_GO_AUDIO_TARGET_SAMPLES 1024
#endif

#ifndef BSP_RETRO_GO_AUDIO_MIN_SPEED_PERCENT
#define BSP_RETRO_GO_AUDIO_MIN_SPEED_PERCENT 25
#endif

#ifndef BSP_RETRO_GO_AUDIO_RATE_WINDOW_MS
#define BSP_RETRO_GO_AUDIO_RATE_WINDOW_MS 500
#endif

#ifndef BSP_RETRO_GO_AUDIO_STARTUP_RATE_WINDOW_MS
#define BSP_RETRO_GO_AUDIO_STARTUP_RATE_WINDOW_MS 100
#endif

#ifndef BSP_RETRO_GO_AUDIO_CONCEAL_FADE_MS
#define BSP_RETRO_GO_AUDIO_CONCEAL_FADE_MS 6
#endif

#if BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES < RETRO_GO_AUDIO_WRITE_SAMPLES || \
    BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES > RETRO_GO_AUDIO_RING_SAMPLES
#error "Retro-Go audio preroll must fit the platform ring"
#endif
#if BSP_RETRO_GO_AUDIO_START_BATCH_SAMPLES > \
        BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES || \
    (BSP_RETRO_GO_AUDIO_START_BATCH_SAMPLES % \
        RETRO_GO_AUDIO_WRITE_SAMPLES) != 0
#error "Retro-Go initial audio batch must be block-aligned and fit preroll"
#endif

#ifndef BSP_RETRO_GO_I2S_THREAD_PRIORITY
#define BSP_RETRO_GO_I2S_THREAD_PRIORITY 21
#endif

#ifndef BSP_RETRO_GO_AUDIO_THREAD_PRIORITY
#define BSP_RETRO_GO_AUDIO_THREAD_PRIORITY 22
#endif

#if defined(FINSH_THREAD_PRIORITY) && \
    (BSP_RETRO_GO_I2S_THREAD_PRIORITY <= FINSH_THREAD_PRIORITY || \
     BSP_RETRO_GO_AUDIO_THREAD_PRIORITY <= FINSH_THREAD_PRIORITY)
#error "Retro-Go audio priority values must be greater than MSH"
#endif

static rt_device_t audio_device;
static struct rt_thread audio_thread RETRO_GO_SOCMEM;
static struct rt_semaphore audio_data_sem RETRO_GO_SOCMEM;
static rt_uint8_t audio_thread_stack[RETRO_GO_AUDIO_STACK_BYTES]
    RETRO_GO_SOCMEM;
static int16_t audio_ring[RETRO_GO_AUDIO_RING_SAMPLES] RETRO_GO_SOCMEM;
static int16_t audio_write_block[RETRO_GO_AUDIO_WRITE_SAMPLES]
    RETRO_GO_DTCM;
#ifdef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
static int16_t audio_start_block[BSP_RETRO_GO_AUDIO_START_BATCH_SAMPLES]
    RETRO_GO_SOCMEM;
#endif
static volatile uint32_t audio_write_index;
static volatile uint32_t audio_read_index;
static volatile uint32_t audio_source_index;
static volatile uint32_t audio_output_index;
static volatile bool audio_stop_requested;
static volatile bool audio_stopped;
static volatile bool audio_thread_reaped = true;
static bool audio_overflow_reported;
static volatile bool audio_playback_started;
static bool audio_thread_started;
static bool audio_ready;

static void audio_thread_cleanup(struct rt_thread *thread)
{
    (void)thread;
    audio_thread_reaped = true;
}

static bool wait_audio_thread_reaped(uint32_t timeout_ms)
{
    uint32_t started = rt_tick_get_millisecond();

    while (!audio_thread_reaped &&
           (uint32_t)(rt_tick_get_millisecond() - started) < timeout_ms)
    {
        /* The static thread object is detached from RT-Thread's defunct
         * queue by idle. Sleeping here gives idle a deterministic window. */
        rt_thread_mdelay(1u);
    }
    return audio_thread_reaped;
}

static bool configure_exact_i2s_clock(void)
{
#ifdef BSP_RETRO_GO_I2S_EXACT_16K_CLOCK
    const en_clk_dst_t divider_group =
        (en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM;
    uint32_t readback[2] __attribute__((aligned(32))) = {0u, 0u};
    cy_en_sysclk_status_t status;

    status = Cy_SysClk_PeriPclkDisableDivider(
        divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u);
    if (status == CY_SYSCLK_SUCCESS)
    {
        /* The register stores divisor-1: value 23 means /24. The vendor
         * mono branch uses 24 (/25, 15.36 kHz), while the board-generated
         * 49.152 MHz audio clock requires /24 for exact 16 kHz LRCK. */
        status = Cy_SysClk_PeriPclkSetFracDivider(
            divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u, 23u, 0u);
    }
    if (status == CY_SYSCLK_SUCCESS)
    {
        status = Cy_SysClk_PeriPclkEnableDivider(
            divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u);
    }
    if (status != CY_SYSCLK_SUCCESS)
    {
        rt_kprintf("[retro-go] exact 16 kHz I2S divider setup failed: %d\n",
                   status);
        return false;
    }
    Cy_SysClk_PeriPclkGetFracDivider(
        divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u,
        &readback[0], &readback[1]);
    rt_kprintf("[retro-go] I2S clock: mono input, divider=%u+%u/32 "
               "(register /%u), LRCK=16000 Hz BCLK=512000 Hz\n",
               (unsigned)readback[0], (unsigned)readback[1],
               (unsigned)(readback[0] + 1u));
    return readback[0] == 23u && readback[1] == 0u;
#else
    return true;
#endif
}

#ifdef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
typedef struct audio_continuity_state
{
    uint32_t phase_q16;
    uint32_t step_q16;
    uint32_t feedforward_q16;
    uint32_t control_started_ms;
    uint32_t control_source_index;
    uint32_t control_output_index;
    uint32_t input_rate_hz;
    uint32_t output_rate_hz;
    uint32_t concealed_samples;
    uint32_t underrun_events;
    int32_t gain_q15;
    int16_t last_source_sample;
    bool measured;
    bool starving;
} audio_continuity_state_t;

static audio_continuity_state_t continuity RETRO_GO_SOCMEM;

static uint32_t continuity_min_step_q16(void)
{
    return (uint32_t)BSP_RETRO_GO_AUDIO_MIN_SPEED_PERCENT *
           RETRO_GO_AUDIO_Q16_ONE / 100u;
}

static void continuity_update_control(void)
{
    uint32_t now_ms = rt_tick_get_millisecond();
    uint32_t elapsed_ms = now_ms - continuity.control_started_ms;
    uint32_t available;
    uint32_t measurement_window_ms = continuity.measured ?
        (uint32_t)BSP_RETRO_GO_AUDIO_RATE_WINDOW_MS :
        (uint32_t)BSP_RETRO_GO_AUDIO_STARTUP_RATE_WINDOW_MS;
    bool first_measurement = false;
    int32_t error;
    int32_t correction_q16;
    int32_t desired_q16;
    const uint32_t maximum_step_q16 = RETRO_GO_AUDIO_Q16_ONE;
    const int32_t correction_limit_q16 =
        (int32_t)(RETRO_GO_AUDIO_Q16_ONE * 3u / 100u);

    if (elapsed_ms >= measurement_window_ms)
    {
        uint32_t source_index = audio_source_index;
        uint32_t output_index = audio_output_index;
        uint32_t source_rate =
            (source_index - continuity.control_source_index) * 1000u /
            elapsed_ms;
        uint32_t output_rate =
            (output_index - continuity.control_output_index) * 1000u /
            elapsed_ms;
        uint32_t feedforward_q16 = (uint32_t)(
            ((uint64_t)source_rate << 16u) / RETRO_GO_AUDIO_RATE);

        if (feedforward_q16 < continuity_min_step_q16())
        {
            feedforward_q16 = continuity_min_step_q16();
        }
        if (feedforward_q16 > maximum_step_q16)
        {
            feedforward_q16 = maximum_step_q16;
        }
        first_measurement = !continuity.measured;
        continuity.measured = true;
        continuity.feedforward_q16 = feedforward_q16;
        continuity.input_rate_hz = source_rate;
        continuity.output_rate_hz = output_rate;
        continuity.control_started_ms = now_ms;
        continuity.control_source_index = source_index;
        continuity.control_output_index = output_index;
    }
#ifndef BSP_RETRO_GO_AUDIO_VARISPEED
    continuity.feedforward_q16 = RETRO_GO_AUDIO_Q16_ONE;
    continuity.step_q16 = RETRO_GO_AUDIO_Q16_ONE;
    return;
#endif
    available = audio_write_index - audio_read_index;
    error = (int32_t)available -
            (int32_t)BSP_RETRO_GO_AUDIO_TARGET_SAMPLES;
    correction_q16 = (int32_t)(((int64_t)error *
        (int32_t)(RETRO_GO_AUDIO_Q16_ONE / 64u)) /
        (int32_t)BSP_RETRO_GO_AUDIO_TARGET_SAMPLES);
    if (correction_q16 < -correction_limit_q16)
    {
        correction_q16 = -correction_limit_q16;
    }
    if (correction_q16 > correction_limit_q16)
    {
        correction_q16 = correction_limit_q16;
    }
    desired_q16 = (int32_t)continuity.feedforward_q16 + correction_q16;
    if (desired_q16 < (int32_t)continuity_min_step_q16())
    {
        desired_q16 = (int32_t)continuity_min_step_q16();
    }
    if (desired_q16 > (int32_t)maximum_step_q16)
    {
        desired_q16 = (int32_t)maximum_step_q16;
    }
    if (first_measurement ||
        (available < RETRO_GO_AUDIO_WRITE_SAMPLES * 2u &&
         (uint32_t)desired_q16 < continuity.step_q16))
    {
        continuity.step_q16 = (uint32_t)desired_q16;
    }
    else if ((uint32_t)desired_q16 < continuity.step_q16)
    {
        continuity.step_q16 =
            (continuity.step_q16 + (uint32_t)desired_q16) / 2u;
    }
    else
    {
        continuity.step_q16 =
            (continuity.step_q16 * 7u + (uint32_t)desired_q16) / 8u;
    }
}

static void continuity_fill_block(int16_t *destination, size_t count)
{
    const uint32_t fade_samples =
        (RETRO_GO_AUDIO_RATE * BSP_RETRO_GO_AUDIO_CONCEAL_FADE_MS) / 1000u;
    const int32_t fade_step =
        (32767 + (int32_t)(fade_samples != 0u ? fade_samples : 1u) - 1) /
        (int32_t)(fade_samples != 0u ? fade_samples : 1u);
    size_t output;

    continuity_update_control();
    for (output = 0u; output < count; ++output)
    {
        uint32_t available = audio_write_index - audio_read_index;

