Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio.c
        if (available >= 2u)
        {
            uint32_t read_index = audio_read_index;
            int32_t first =
                audio_ring[read_index & RETRO_GO_AUDIO_RING_MASK];
            int32_t second =
                audio_ring[(read_index + 1u) & RETRO_GO_AUDIO_RING_MASK];
            int32_t sample = first +
                (int32_t)(((int64_t)(second - first) *
                           (int32_t)(continuity.phase_q16 & 0xffffu)) >> 16u);
            uint32_t advance;

            continuity.phase_q16 += continuity.step_q16;
            advance = continuity.phase_q16 >> 16u;
            if (advance >= available)
            {
                advance = available - 1u;
            }
            audio_read_index += advance;
            continuity.phase_q16 &= 0xffffu;
            continuity.last_source_sample = (int16_t)sample;
            continuity.starving = false;
            if (continuity.gain_q15 < 32767)
            {
                continuity.gain_q15 += fade_step;
                if (continuity.gain_q15 > 32767)
                {
                    continuity.gain_q15 = 32767;
                }
            }
            destination[output] = continuity.gain_q15 == 32767 ?
                (int16_t)sample : (int16_t)(
                    sample * continuity.gain_q15 / 32767);
        }
        else
        {
            if (!continuity.starving)
            {
                continuity.starving = true;
                ++continuity.underrun_events;
            }
            if (continuity.gain_q15 > 0)
            {
                continuity.gain_q15 -= fade_step;
                if (continuity.gain_q15 < 0)
                {
                    continuity.gain_q15 = 0;
                }
            }
            destination[output] = (int16_t)(
                (int32_t)continuity.last_source_sample *
                continuity.gain_q15 / 32767);
            ++continuity.concealed_samples;
        }
    }
}
#endif

static bool configure_i2s_thread_priority(void)
{
    rt_thread_t thread = rt_thread_find("sound_thread");
    rt_uint8_t priority = BSP_RETRO_GO_I2S_THREAD_PRIORITY;

    if (thread == RT_NULL)
    {
        rt_kprintf("[retro-go] I2S playback thread not found\n");
        return false;
    }
    if (rt_thread_control(thread, RT_THREAD_CTRL_CHANGE_PRIORITY,
                          &priority) != RT_EOK)
    {
        rt_kprintf("[retro-go] I2S playback priority setup failed\n");
        return false;
    }
    return true;
}

static bool verify_driver_input_format(void)
{
    struct rt_audio_caps readback;

    rt_memset(&readback, 0, sizeof(readback));
    readback.main_type = AUDIO_TYPE_OUTPUT;
    readback.sub_type = AUDIO_DSP_PARAM;
    if (rt_device_control(audio_device, AUDIO_CTL_GETCAPS, &readback) !=
            RT_EOK ||
        readback.udata.config.samplerate != RETRO_GO_AUDIO_RATE ||
        readback.udata.config.channels != 1u ||
        readback.udata.config.samplebits != 16u)
    {
        rt_kprintf("[retro-go] audio format mismatch: rate=%u channels=%u "
                   "bits=%u (required 16000/1/16)\n",
                   (unsigned)readback.udata.config.samplerate,
                   (unsigned)readback.udata.config.channels,
                   (unsigned)readback.udata.config.samplebits);
        return false;
    }
    rt_kprintf("[retro-go] audio format readback: 16000 Hz, "
               "channels=1 mono s16; driver expands to dual-mono I2S\n");
    return true;
}

#ifndef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
static size_t ring_take(int16_t *destination, size_t capacity)
{
    rt_base_t level;
    uint32_t available;
    size_t count;
    size_t first;

    level = rt_hw_interrupt_disable();
    available = audio_write_index - audio_read_index;
    if (available < capacity && !audio_stop_requested)
    {
        rt_hw_interrupt_enable(level);
        return 0u;
    }
    count = available < capacity ? (size_t)available : capacity;
    count &= ~(size_t)1u;
    first = count;
    if (first > RETRO_GO_AUDIO_RING_SAMPLES -
                    (audio_read_index & RETRO_GO_AUDIO_RING_MASK))
    {
        first = RETRO_GO_AUDIO_RING_SAMPLES -
                (audio_read_index & RETRO_GO_AUDIO_RING_MASK);
    }
    if (first != 0u)
    {
        memcpy(destination,
               &audio_ring[audio_read_index & RETRO_GO_AUDIO_RING_MASK],
               first * sizeof(destination[0]));
    }
    if (count > first)
    {
        memcpy(destination + first, audio_ring,
               (count - first) * sizeof(destination[0]));
    }
    audio_read_index += (uint32_t)count;
    rt_hw_interrupt_enable(level);
    return count;
}
#endif

static void audio_thread_entry(void *parameter)
{
#ifdef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
    bool first_device_write = true;
#endif

    (void)parameter;
    audio_stopped = false;
    while (!audio_stop_requested)
    {
#ifdef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
        rt_ssize_t written;
        int16_t *write_block = first_device_write ?
            audio_start_block : audio_write_block;
        size_t write_samples = first_device_write ?
            BSP_RETRO_GO_AUDIO_START_BATCH_SAMPLES :
            RETRO_GO_AUDIO_WRITE_SAMPLES;

        if (!audio_playback_started)
        {
            if (rt_sem_take(&audio_data_sem, RT_WAITING_FOREVER) != RT_EOK)
            {
                continue;
            }
            if (!audio_playback_started)
            {
                continue;
            }
        }
        continuity_fill_block(write_block, write_samples);
        written = audio_device != RT_NULL ?
            rt_device_write(audio_device, 0, write_block,
                            write_samples * sizeof(write_block[0])) : 0;
        if (written ==
            (rt_ssize_t)(write_samples * sizeof(write_block[0])))
        {
            audio_output_index += (uint32_t)write_samples;
            first_device_write = false;
        }
        else if (!audio_stop_requested)
        {
            rt_thread_mdelay(1u);
        }
#else
        size_t count;

