Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio.c
        if (rt_sem_take(&audio_data_sem, RT_WAITING_FOREVER) != RT_EOK)
        {
            continue;
        }
        do
        {
            count = ring_take(audio_write_block,
                              RETRO_GO_AUDIO_WRITE_SAMPLES);
            if (count != 0u && audio_device != RT_NULL)
            {
                rt_ssize_t written = rt_device_write(
                    audio_device, 0, audio_write_block,
                    count * sizeof(audio_write_block[0]));
                if (written ==
                    (rt_ssize_t)(count * sizeof(audio_write_block[0])))
                {
                    audio_output_index += (uint32_t)count;
                }
            }
        } while (count != 0u && !audio_stop_requested);
#endif
    }
    audio_stopped = true;
}

bool retro_go_audio_init(void)
{
#ifdef BSP_RETRO_GO_AUDIO
    struct rt_audio_caps caps;
    rt_err_t result;

    if (audio_thread_started || !audio_thread_reaped)
    {
        rt_kprintf("[retro-go] previous audio worker is still retiring\n");
        return false;
    }

    audio_device = rt_device_find("sound0");
    if (audio_device == RT_NULL)
    {
        rt_kprintf("[retro-go] sound0 not found; audio disabled\n");
        return false;
    }
    if (!configure_i2s_thread_priority())
    {
        audio_device = RT_NULL;
        return false;
    }
    if (rt_device_open(audio_device, RT_DEVICE_OFLAG_WRONLY) != RT_EOK)
    {
        rt_kprintf("[retro-go] sound0 open failed; audio disabled\n");
        audio_device = RT_NULL;
        return false;
    }

    rt_memset(&caps, 0, sizeof(caps));
    caps.main_type = AUDIO_TYPE_OUTPUT;
    caps.sub_type = AUDIO_DSP_PARAM;
    caps.udata.config.samplerate = 16000u;
    /* The BSP_USING_SDLPAL driver input contract is mono. Its playback task
     * expands every input sample to L/R itself. Setting channels=2 selects
     * drv_i2s.c's divider-11 branch and drives LRCK at roughly 32 kHz. The
     * mono contract selects the driver divider-24 branch; the platform then
     * corrects its off-by-one value to 23 for an exact 16 kHz sink. */
    caps.udata.config.channels = 1u;
    caps.udata.config.samplebits = 16u;
    if (rt_device_control(audio_device, AUDIO_CTL_CONFIGURE, &caps) != RT_EOK)
    {
        rt_kprintf("[retro-go] sound0 configure failed; audio disabled\n");
        (void)rt_device_close(audio_device);
        audio_device = RT_NULL;
        return false;
    }
    if (!verify_driver_input_format())
    {
        (void)rt_device_close(audio_device);
        audio_device = RT_NULL;
        return false;
    }
    if (!configure_exact_i2s_clock())
    {
        rt_kprintf("[retro-go] exact 16 kHz clock unavailable; audio disabled\n");
        (void)rt_device_close(audio_device);
        audio_device = RT_NULL;
        return false;
    }

    audio_write_index = 0u;
    audio_read_index = 0u;
    audio_source_index = 0u;
    audio_output_index = 0u;
    audio_stop_requested = false;
    audio_stopped = false;
    audio_thread_reaped = false;
    audio_overflow_reported = false;
    audio_playback_started = false;
#ifdef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
    memset(&continuity, 0, sizeof(continuity));
    continuity.phase_q16 = 0u;
    continuity.step_q16 = RETRO_GO_AUDIO_Q16_ONE;
    continuity.feedforward_q16 = RETRO_GO_AUDIO_Q16_ONE;
    continuity.gain_q15 = 32767;
    continuity.control_started_ms = rt_tick_get_millisecond();
#endif
    result = rt_sem_init(&audio_data_sem, "rg_audio", 0u,
                         RT_IPC_FLAG_FIFO);
    if (result != RT_EOK)
    {
        audio_thread_reaped = true;
        (void)rt_device_close(audio_device);
        audio_device = RT_NULL;
        return false;
    }
    result = rt_thread_init(
        &audio_thread, "rg_audio", audio_thread_entry, RT_NULL,
        audio_thread_stack, sizeof(audio_thread_stack),
        BSP_RETRO_GO_AUDIO_THREAD_PRIORITY, 5u);
    if (result != RT_EOK)
    {
        audio_thread_reaped = true;
        (void)rt_sem_detach(&audio_data_sem);
        (void)rt_device_close(audio_device);
        audio_device = RT_NULL;
        return false;
    }
    audio_thread.cleanup = audio_thread_cleanup;
    result = rt_thread_startup(&audio_thread);
    if (result != RT_EOK)
    {
        (void)rt_thread_detach(&audio_thread);
        (void)wait_audio_thread_reaped(500u);
        (void)rt_sem_detach(&audio_data_sem);
        (void)rt_device_close(audio_device);
        audio_device = RT_NULL;
        return false;
    }

    audio_thread_started = true;
    audio_ready = true;
    rt_kprintf("[retro-go] audio ready: 16000 Hz mono input -> driver "
               "dual-mono I2S, "
               "async ring=%u, preroll=%u, start-batch=%u, "
               "continuity=%s, priority=%u/%u\n",
               RETRO_GO_AUDIO_RING_SAMPLES,
               BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES,
               BSP_RETRO_GO_AUDIO_START_BATCH_SAMPLES,
#ifdef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
#ifdef BSP_RETRO_GO_AUDIO_VARISPEED
               "linear-varispeed",
#else
               "linear-conceal",
#endif
#else
               "off",
#endif
               BSP_RETRO_GO_I2S_THREAD_PRIORITY,
               BSP_RETRO_GO_AUDIO_THREAD_PRIORITY);
    return true;
#else
    return false;
#endif
}

void retro_go_audio_submit(const int16_t *samples, size_t sample_count)
{
    rt_base_t level;
    uint32_t used;
    size_t free_samples;
    size_t accepted;
    size_t first;
    size_t dropped;
    bool report_overflow = false;
    bool wake_worker = false;

    if (!audio_ready || samples == NULL || sample_count == 0u)
    {
        return;
    }
    sample_count &= ~(size_t)1u;
    if (sample_count == 0u)
    {
        return;
    }
    level = rt_hw_interrupt_disable();
#ifdef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
    if (audio_source_index == 0u)
    {
        continuity.control_started_ms = rt_tick_get_millisecond();
        continuity.control_source_index = (uint32_t)sample_count;
        continuity.control_output_index = 0u;
    }
#endif
    audio_source_index += (uint32_t)sample_count;
    used = audio_write_index - audio_read_index;
    free_samples = RETRO_GO_AUDIO_RING_SAMPLES - used;
    accepted = sample_count < free_samples ? sample_count : free_samples;
    accepted &= ~(size_t)1u;
    first = accepted;
    if (first > RETRO_GO_AUDIO_RING_SAMPLES -
                    (audio_write_index & RETRO_GO_AUDIO_RING_MASK))
    {
        first = RETRO_GO_AUDIO_RING_SAMPLES -
                (audio_write_index & RETRO_GO_AUDIO_RING_MASK);
    }
    if (first != 0u)
    {
        memcpy(&audio_ring[audio_write_index & RETRO_GO_AUDIO_RING_MASK],
               samples, first * sizeof(samples[0]));
    }
    if (accepted > first)
    {
        memcpy(audio_ring, samples + first,
               (accepted - first) * sizeof(samples[0]));
    }
    audio_write_index += (uint32_t)accepted;
    if (accepted != 0u && !audio_playback_started &&
        (audio_write_index - audio_read_index) >=
            BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES)
    {
        audio_playback_started = true;
        wake_worker = true;
    }
#ifndef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
    else if (accepted != 0u && audio_playback_started)
    {
        wake_worker = true;
    }
#endif
    dropped = sample_count - accepted;
    if (dropped != 0u && !audio_overflow_reported)
    {
        audio_overflow_reported = true;
        report_overflow = true;
    }
    rt_hw_interrupt_enable(level);

