Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio.c
    if (wake_worker)
    {
        (void)rt_sem_release(&audio_data_sem);
    }
    if (report_overflow)
    {
        rt_kprintf("[retro-go] audio buffer overrun; dropped=%u samples\n",
                   (unsigned)dropped);
    }
}

size_t retro_go_audio_buffered_samples(void)
{
    rt_base_t level = rt_hw_interrupt_disable();
    size_t buffered = audio_ready ?
        (size_t)(audio_write_index - audio_read_index) : 0u;

    rt_hw_interrupt_enable(level);
    return buffered;
}

uint32_t retro_go_audio_submitted_samples(void)
{
    rt_base_t level = rt_hw_interrupt_disable();
    uint32_t submitted = audio_write_index;

    rt_hw_interrupt_enable(level);
    return submitted;
}

void retro_go_audio_get_stats(retro_go_audio_stats_t *stats)
{
    rt_base_t level;
    uint32_t available;
    uint32_t step_q16 = RETRO_GO_AUDIO_Q16_ONE;

    if (stats == NULL)
    {
        return;
    }
    memset(stats, 0, sizeof(*stats));
    level = rt_hw_interrupt_disable();
    available = audio_ready ? audio_write_index - audio_read_index : 0u;
    stats->source_buffer_samples = available;
#ifdef BSP_RETRO_GO_AUDIO_CONTINUITY_LINEAR
    step_q16 = continuity.step_q16 != 0u ?
        continuity.step_q16 : RETRO_GO_AUDIO_Q16_ONE;
    stats->input_rate_hz = continuity.input_rate_hz;
    stats->output_rate_hz = continuity.output_rate_hz;
    stats->concealed_samples = continuity.concealed_samples;
    stats->underrun_events = continuity.underrun_events;
#endif
    rt_hw_interrupt_enable(level);
    stats->stretch_permille =
        (uint32_t)(((uint64_t)step_q16 * 1000u) >> 16u);
    stats->source_buffer_ms = step_q16 != 0u ?
        (uint32_t)(((uint64_t)available * 1000u *
                    RETRO_GO_AUDIO_Q16_ONE) /
                   ((uint64_t)RETRO_GO_AUDIO_RATE * step_q16)) : 0u;
}

void retro_go_audio_deinit(void)
{
    uint32_t started;

    audio_ready = false;
    if (audio_thread_started)
    {
        audio_stop_requested = true;
        (void)rt_sem_release(&audio_data_sem);
        started = rt_tick_get_millisecond();
        while (!audio_stopped &&
               (uint32_t)(rt_tick_get_millisecond() - started) < 500u)
        {
            rt_thread_mdelay(1u);
        }
        if (audio_stopped && wait_audio_thread_reaped(500u))
        {
            /* The idle thread has detached the static worker object. Only
             * its separately initialized semaphore remains ours to detach. */
            (void)rt_sem_detach(&audio_data_sem);
            audio_thread_started = false;
        }
        else if (!audio_stopped)
        {
            rt_kprintf("[retro-go] audio worker stop timeout\n");
        }
        else
        {
            rt_kprintf("[retro-go] audio worker idle cleanup timeout\n");
        }
    }
    if (audio_device != RT_NULL &&
        (!audio_thread_started || audio_stopped))
    {
        (void)rt_device_close(audio_device);
        audio_device = RT_NULL;
    }
}
